                                 Getting Familiar with Pandas:

In [1]:
import pandas as pd

In [2]:
                               # Creating a Series
data_series= pd.Series([10, 20, 30, 40, 50,60,70,80,90])
print(data_series)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [36]:
                                # Creating a DataFrame 
data=[['girish',22,'Japan'],['prem',39,'Japan'],['hitesh',25,'Japan']]
data_frame=pd.DataFrame(data, columns=['Name','Rollno','country'])
print(data_frame)

     Name  Rollno country
0  girish      22   Japan
1    prem      39   Japan
2  hitesh      25   Japan

In [35]:
df1=pd.read_csv("C:/Users/srisr/Downloads/Toy-Sales-dataset.csv")
print(df1)

    Month  Sales  PromExp  Price  AdExp
0       1  73959    61.13   8.75  50.04
1       2  71544    60.19   8.99  50.74
2       3  78587    59.16   7.50  50.14
3       4  80364    60.38   7.25  50.27
4       5  78771    59.71   7.40  51.25
5       6  71986    59.88   8.50  50.65
6       7  74885    60.14   8.40  50.87
7       8  73345    60.08   7.90  50.15
8       9  76659    59.90   7.25  48.24
9      10  71880    59.68   8.70  50.19
10     11  73598    59.83   8.40  51.11
11     12  74893    59.77   8.10  51.49
12     13  69003    59.29   8.40  50.10
13     14  78542    60.40   7.40  49.24
14     15  72543    59.89   8.00  50.04
15     16  74247    60.06   8.30  49.46
16     17  76253    60.51   8.10  51.62
17     18  72582    58.93   8.20  49.78
18     19  69022    60.09   8.99  48.60
19     20  76200    61.00   7.99  49.00
20     21  69701    59.00   8.50  48.00
21     22  77005    59.50   7.90  54.00
22     23  70987    58.00   7.99  48.70
23     24  75643    60.50   8.25  50.00

In [37]:
                                   # Selecting data
print(data_frame['Name'])

0    girish
1      prem
2    hitesh
Name: Name, dtype: object

In [38]:
                                    # Filtering rows
print(data_frame[data_frame['Rollno'] > 30])

   Name  Rollno country
1  prem      39   Japan

In [40]:
                                     # Modifying data
data_frame['Rollno'] += 2
print(data_frame)

     Name  Rollno country
0  girish      25   Japan
1    prem      42   Japan
2  hitesh      28   Japan

                                Data Handling with Pandas:

In [42]:
import numpy as np

In [79]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Edward', 'Alice'],
    'Age': [24, 27, np.nan, 22, 32, 24],
    'City': ['New York', 'Los Angeles', 'New York', 'Boston', 'Chicago', 'New York'],
    'Salary': [70000, 80000, np.nan, 60000, np.nan, 70000]}
df = pd.DataFrame(data)
print(df)

      Name   Age         City   Salary
0    Alice  24.0     New York  70000.0
1      Bob  27.0  Los Angeles  80000.0
2  Charlie   NaN     New York      NaN
3    David  22.0       Boston  60000.0
4   Edward  32.0      Chicago      NaN
5    Alice  24.0     New York  70000.0

In [80]:
print("\nMissing values in each column:")
print(df.isna().sum())

Missing values in each column:
Name      0
Age       1
City      0
Salary    2
dtype: int64

In [81]:
# Drop missing data

df.dropna()

    Name   Age         City   Salary
0  Alice  24.0     New York  70000.0
1    Bob  27.0  Los Angeles  80000.0
3  David  22.0       Boston  60000.0
5  Alice  24.0     New York  70000.0

In [82]:
# Remove duplicates

df.drop_duplicates()

      Name   Age         City   Salary
0    Alice  24.0     New York  70000.0
1      Bob  27.0  Los Angeles  80000.0
2  Charlie   NaN     New York      NaN
3    David  22.0       Boston  60000.0
4   Edward  32.0      Chicago      NaN

In [86]:
                       # Filling missing values with a specific value
data_fill = df.fillna(0)
print(data_fill)

      Name   Age         City   Salary
0    Alice  24.0     New York  70000.0
1      Bob  27.0  Los Angeles  80000.0
2  Charlie   0.0     New York      0.0
3    David  22.0       Boston  60000.0
4   Edward  32.0      Chicago      0.0
5    Alice  24.0     New York  70000.0

                                Data Analysis with Pandas:

In [90]:
                    # Generating summary statistics
df.describe()

             Age        Salary
count   5.000000      4.000000
mean   25.800000  70000.000000
std     3.898718   8164.965809
min    22.000000  60000.000000
25%    24.000000  67500.000000
50%    24.000000  70000.000000
75%    27.000000  72500.000000
max    32.000000  80000.000000

In [97]:
city_stats = df.groupby('City').agg({
    'Age': ['mean', 'median', 'std'],   # Mean, Median, and Standard Deviation of Age
    'Salary': ['mean', 'median', 'std']  # Mean, Median, and Standard Deviation of Salary
})
print(city_stats)

              Age               Salary
             mean median  std     mean   median  std
City
Boston       22.0   22.0  NaN  60000.0  60000.0  NaN
Chicago      32.0   32.0  NaN      NaN      NaN  NaN
Los Angeles  27.0   27.0  NaN  80000.0  80000.0  NaN
New York     24.0   24.0  0.0  70000.0  70000.0  0.0

                        Advanced data manipulation techniques

In [102]:
df_bonus = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Bonus': [5000, 6000, 5500, 4000]
    })
merged_df_bonus = pd.merge(df, df_bonus, on='Name', how='left')
print("\nMerged DataFrame with Bonus:")
print(merged_df_bonus)

Merged DataFrame with Bonus:
      Name   Age         City   Salary   Bonus
0    Alice  24.0     New York  70000.0  5000.0
1      Bob  27.0  Los Angeles  80000.0  6000.0
2  Charlie   NaN     New York      NaN  5500.0
3    David  22.0       Boston  60000.0  4000.0
4   Edward  32.0      Chicago      NaN     NaN
5    Alice  24.0     New York  70000.0  5000.0

In [106]:
# Split original DataFrame into two parts
df_part1 = df.head(4)
df_part2 = df.tail(3)

# Concatenate vertically
concatenated_vertical = pd.concat([df_part1, df_part2])
print("\nConcatenated DataFrame:")
print(concatenated_vertical)

Concatenated DataFrame:
      Name   Age         City   Salary
0    Alice  24.0     New York  70000.0
1      Bob  27.0  Los Angeles  80000.0
2  Charlie   NaN     New York      NaN
3    David  22.0       Boston  60000.0
3    David  22.0       Boston  60000.0
4   Edward  32.0      Chicago      NaN
5    Alice  24.0     New York  70000.0

    Conclusion
Pandas is a vital tool for data science professionals due to its robust capabilities for data manipulation and analysis. Here's how it benefits the workflow:

1.)Efficient Data Handling: Pandas provides powerful data structures like DataFrame and Series, which streamline data operations and simplify handling large datasets.

2.)Advanced Operations: With functions for grouping, merging, and concatenating, Pandas enables complex data transformations and integration, essential for comprehensive analysis.

3.)Performance and Flexibility: Pandas outperforms traditional Python data structures in terms of speed and memory efficiency, making it ideal for big data and intricate data tasks.

          Advantages of Using Pandas Over Traditional Python Data Structures
                                                                                     -1.)Structured Data Representation: Pandas DataFrame and Series offer a tabular format with labeled axes, simplifying data organization compared to lists or dictionaries.

2.)Ease of Manipulation: Pandas includes powerful methods for data manipulation, such as groupby(), merge(), and pivot_table(), which streamline complex operations.

3.)Data Cleaning: Built-in functions like fillna() and dropna() efficiently handle missing data, making preprocessing easier.

4.)Performance: Pandas is optimized for speed and memory usage, handling large datasets more efficiently than traditional structures.

Real-World Examples Where Pandas is Essential
                                                                                                                                                                                            Data Cleaning:
Example: In a retail company, Pandas is used to handle missing values, remove duplicates, and standardize data formats before analysis.
                                                                                        Exploratory Data Analysis (EDA):
Example: A data scientist uses Pandas to generate summary statistics, visualize data distributions, and identify trends in customer transaction data.
                                                                                            Financial Analysis:
Example: Analysts use Pandas to clean stock price data, calculate moving averages, and analyze investment trends.
                                                                                              Customer Segmentation:
Example: Marketers segment customers based on purchasing behavior and demographics using Pandas' groupby() and aggregation methods.
                                                                                         Healthcare Data Analysis:
Example: Researchers preprocess and analyze clinical trial data with Pandas to extract meaningful insights and trends.